#string=['车次':  ('G1560', 'G1567', 'G8917', 'G203'), '出发站-到达站':[北京南-天津南,北京南-天津南,北京南-天津西,北京南-天津南],'
#'出发时间': [18:05,18:15,18:20,18:35], '到达时间': [18:39,18:49,19:19,19:09], '历史时长':[00:34,00:34,00:59,00:34]]

dict1=['G1560', 'G1567', 'G8917', 'G203']
dict2=['车次','出发站-到达站','出发时间','到达时间','历史时长' ]
dict3=['北京南-天津南','北京南-天津南','北京南-天津西','北京南-天津南']
dict4=['18:05','18:15','18:20','18:35']
dict5=['18:39','18:49','19:19','19:09']
dict6=['00:34','00:34','00:59','00:34']
dict7=dict(zip(dict2,dict1))
dict8=dict(zip(dict7,dict3))
print(dict8)
